In [1]:
def squ(y):
    return y*y
squ(2)

4

# Anonomyus or Lambda function

In [5]:
s=lambda x:x*x*x

In [6]:
s(2)

8

In [ ]:
.apply(lambda x : x*x)  ----> This is used in with dataframe operations

#### Map function

In [8]:
map()

TypeError: map() must have at least two arguments.

In [9]:
myf = ['Hero','Dinakar','Srinu']

In [18]:
emylist = []
for i in myf:
    uppr = i.upper()
    emylist.append(uppr)

print(emylist)

['HERO', 'DINAKAR', 'SRINU']

In [21]:
list(map(str.upper,myf))

['HERO', 'DINAKAR', 'SRINU']

In [22]:
## Assignment
float_nums = [5.33,5.66,23.55]
list(map(round,float_nums))

In [25]:
list(map(round,float_nums))

[5, 6, 24]

In [36]:
ls1=['Abhijith','Senthil','Hari','Laxmi']
ls2=list(range(1,5))
ls3=list()
for i,j in zip(ls1,ls2):
    ls3.append((i,j)) 
print(ls3)

[('Abhijith', 1), ('Senthil', 2), ('Hari', 3), ('Laxmi', 4)]

In [31]:
list(map(lambda x: (x),zip(ls1,ls2)))

[('Abhijith', 1), ('Senthil', 2), ('Hari', 3), ('Laxmi', 4)]

In [34]:
len(ls1)

4

In [38]:
list(map(lambda x:x,zip(ls1,ls2)))

[('Abhijith', 1), ('Senthil', 2), ('Hari', 3), ('Laxmi', 4)]

In [39]:
res = list(map(lambda a,b:(a,b),ls1,ls2))
res

[('Abhijith', 1), ('Senthil', 2), ('Hari', 3), ('Laxmi', 4)]

#####  Filter function

In [53]:
salary = [50000,40000,23000,4900]
lst=[]
for i in salary:
    if(i < 35000):
        lst.append(i)
        
lst

[23000, 4900]

In [54]:
def low_sal(salaries):
    return salaries < 2500

In [55]:
list(filter(low_sal,salary))

[]

##### List comprehresion

In [57]:
words = ['Pythn','suene','kljd','Raj']
vow = ['a','e','i','o','u']

In [61]:
for i,j in words,vow:
    if i in j:
        print(i)

ValueError: too many values to unpack (expected 2)

In [62]:
words=['Inceptez','Batch15','Pythn','class']
Vowels=['a','e','o','u']

for i in words:
    j=i.lower()
    for k in Vowels:
        if k in j:
            print(i)

Inceptez
Batch15
class

In [64]:
hal = [i for i in words for k in i if k in Vowels]

In [65]:
hal

['Inceptez', 'Inceptez', 'Batch15', 'class']

##### reduce

In [67]:
import functools

In [69]:
import pandas as pd
import numpy as np
rea = pd.read_csv(r"C:\Users\Lenovo\Desktop\Data_Science\Inceptez\SOURCE\orders.csv")
rea.head(2)

,Order Id,Date,Meal Id,Company Id,Date of Meal,Participants,Meal Price,Type of Meal,Heroes Adjustment
0,839FKFW2LLX4LMBB,2016-05-27,INBUX904GIHI8YBD,LJKS5NK6788CYMUU,2016-05-31 07:00:00+02:00,['David Bishop'],469.0,Breakfast,False
1,97OX39BGVMHODLJM,2018-09-27,J0MMOOPP709DIDIE,LJKS5NK6788CYMUU,2018-10-01 20:00:00+02:00,['David Bishop'],22.0,Dinner,False

In [71]:
rea.dtypes

Order Id              object
Date                  object
Meal Id               object
Company Id            object
Date of Meal          object
Participants          object
Meal Price           float64
Type of Meal          object
Heroes Adjustment     object
dtype: object

In [73]:
rea['Type of Meal'].value_counts()

Dinner       4848
Breakfast    4766
Lunch        4747
Name: Type of Meal, dtype: int64

In [75]:
rea['Date'] = rea['Date'].astype('datetime64')

In [76]:
rea.dtypes

Order Id                     object
Date                 datetime64[ns]
Meal Id                      object
Company Id                   object
Date of Meal                 object
Participants                 object
Meal Price                  float64
Type of Meal                 object
Heroes Adjustment            object
dtype: object

In [78]:
rea['Date'].head(3)

0   2016-05-27
1   2018-09-27
2   2014-08-24
Name: Date, dtype: datetime64[ns]

In [80]:
rea['Date'].dt.date.head(2)

0    2016-05-27
1    2018-09-27
Name: Date, dtype: object

In [84]:
rea['Date'].dt.month_name().head(2)

0          May
1    September
Name: Date, dtype: object

In [86]:
rea['Date'].dt.month().head(2)

TypeError: 'Series' object is not callable

In [88]:
rea['Date'].dt.month.head(2)

0    5
1    9
Name: Date, dtype: int64

In [90]:
rea['Type of Meal'] = rea['Type of Meal'].astype('category')

In [91]:
rea['Type of Meal'].cat.categories

Index(['Breakfast', 'Dinner', 'Lunch'], dtype='object')

In [93]:
rea['Type of Meal'].cat.codes

0        0
1        1
2        2
3        1
4        2
        ..
14357    2
14358    1
14359    0
14360    0
14361   -1
Length: 14362, dtype: int8

In [92]:
rea['Type of Meal'].cat.reorder_categories(['Breakfast', 'Dinner', 'Lunch'])

0        Breakfast
1           Dinner
2            Lunch
3           Dinner
4            Lunch
           ...
14357        Lunch
14358       Dinner
14359    Breakfast
14360    Breakfast
14361          NaN
Name: Type of Meal, Length: 14362, dtype: category
Categories (3, object): [Breakfast, Dinner, Lunch]

In [94]:
rea.isna().sum()

Order Id             0
Date                 0
Meal Id              0
Company Id           0
Date of Meal         1
Participants         1
Meal Price           1
Type of Meal         1
Heroes Adjustment    1
dtype: int64

In [95]:
rea.dropna(inplace=True)

In [96]:
## Assignment: insert a  record at index 70000 to a column meal price

In [98]:
rea.shape

(14361, 9)

In [99]:
rea.loc[70000,'Meal Price']='not a number but a strig'

##### Apply

In [100]:
rea['Type of Meal']=rea['Type of Meal'].apply(lambda x:x.lower())

In [108]:
## Assignment : find the values counts to different datatypes inside 'meal price'

In [109]:
rea.dtypes.value_counts()

object            7
category          1
datetime64[ns]    1
dtype: int64

In [110]:
ls=rea['Meal Price'].apply(lambda x:type(x))
ls.value_counts()

<class 'float'>    14361
<class 'str'>          1
Name: Meal Price, dtype: int64

In [1]:
import pandas as pd
import numpy as np
df = pd.read_csv(r"C:\Users\Lenovo\Desktop\Data_Science\Inceptez\SOURCE\orders.csv")
df.head(2)

,Order Id,Date,Meal Id,Company Id,Date of Meal,Participants,Meal Price,Type of Meal,Heroes Adjustment
0,839FKFW2LLX4LMBB,2016-05-27,INBUX904GIHI8YBD,LJKS5NK6788CYMUU,2016-05-31 07:00:00+02:00,['David Bishop'],469.0,Breakfast,False
1,97OX39BGVMHODLJM,2018-09-27,J0MMOOPP709DIDIE,LJKS5NK6788CYMUU,2018-10-01 20:00:00+02:00,['David Bishop'],22.0,Dinner,False

In [2]:
df1 = df.copy()

In [3]:
df1.count()

Order Id             14362
Date                 14362
Meal Id              14362
Company Id           14362
Date of Meal         14361
Participants         14361
Meal Price           14361
Type of Meal         14361
Heroes Adjustment    14361
dtype: int64

In [6]:
df1.append(new_row,ignore_index=True)

NameError: name 'new_row' is not defined

In [7]:
df1.append(df)

,Order Id,Date,Meal Id,Company Id,Date of Meal,Participants,Meal Price,Type of Meal,Heroes Adjustment
0,839FKFW2LLX4LMBB,2016-05-27,INBUX904GIHI8YBD,LJKS5NK6788CYMUU,2016-05-31 07:00:00+02:00,['David Bishop'],469.0,Breakfast,False
1,97OX39BGVMHODLJM,2018-09-27,J0MMOOPP709DIDIE,LJKS5NK6788CYMUU,2018-10-01 20:00:00+02:00,['David Bishop'],22.0,Dinner,False
2,041ORQM5OIHTIU6L,2014-08-24,E4UJLQNCI16UX5CS,LJKS5NK6788CYMUU,2014-08-23 14:00:00+02:00,['Karen Stansell'],314.0,Lunch,False
3,YT796QI18WNGZ7ZJ,2014-04-12,C9SDFHF7553BE247,LJKS5NK6788CYMUU,2014-04-07 21:00:00+02:00,['Addie Patino'],438.0,Dinner,False
4,6YLROQT27B6HRF4E,2015-07-28,48EQXS6IHYNZDDZ5,LJKS5NK6788CYMUU,2015-07-27 14:00:00+02:00,['Addie Patino' 'Susan Guerrero'],690.0,Lunch,False
...,...,...,...,...,...,...,...,...,...
14357,BD2DKH8I61Y0NL7Z,2018-01-12,4VLH5HYF70RP1YJK,I27J9NPYES4BIXBR,2018-01-16 14:00:00+01:00,['Sharon Goines' 'Margo Deslauriers'],280.0,Lunch,False
14358,RFK2C21CD7IAOUZT,2016-06-30,EGQRRRN5D1Y97WGD,I27J9NPYES4BIXBR,2016-06-26 20:00:00+02:00,['Kenisha Ordonez'],49.0,Dinner,False
14359,2UMDU938DTE7D808,2016-04-10,AV323CBF7N78MCYD,I27J9NPYES4BIXBR,2016-04-10 07:00:00+02:00,['Douglas Villanueva'],81.0,Breakfast,False
14360,NEER4D5TN6GQV9WA,2015-07-19,RDLHP30JLO9RYWDR,I27J9NPYES4BIXBR,2015-07-21 09:00:00+02:00,['Douglas Villanueva' 'Kenisha Ordonez'],210.0,Breakfast,False
14361,2NF38UES2LW6TR2A,2017-02-24,MOEZTCDKASD8Z0UP,I,NaN,NaN,NaN,NaN,NaN

In [10]:
df1.loc[1000,:]

Order Id                      D0395E9EXLRNNC5Q
Date                                2015-05-30
Meal Id                       8LWTFEH1ST5TCWVA
Company Id                    9HUDWGJ1CU1IKMEJ
Date of Meal         2015-05-27 14:00:00+02:00
Participants                 ['Latanya Davis']
Meal Price                                  15
Type of Meal                             Lunch
Heroes Adjustment                        False
Name: 1000, dtype: object

In [12]:
new_row = {'Order Id':['D0395E9989LRNNC5Q','D0395E9EXLRNNC5e'],
          'Date':['2020-01-20','2019-09-18'],
          'Meal Id':['8LWTFEH1ST5TCWVA','8LWTFEH1ST5TCWVA']}

In [14]:
pd.concat([df1,new_row])

TypeError: cannot concatenate object of type '<class 'dict'>'; only Series and DataFrame objs are valid

In [15]:
import pandas as pd
import numpy as np
ol = pd.read_csv(r"C:\Users\Lenovo\Desktop\Data_Science\Inceptez\SOURCE\order_leads.csv")
ol.head(2)

,Order Id,Company Id,Company Name,Date,Order Value,Converted
0,80EYLOKP9E762WKG,LJKS5NK6788CYMUU,Chimera-Chasing Casbah,2017-02-18,4875.0,1.0
1,TLEXR1HZWTUTBHPB,LJKS5NK6788CYMUU,Chimera-Chasing Casbah,2015-07-30,8425.0,0.0

In [16]:
st = pd.read_csv(r"C:\Users\Lenovo\Desktop\Data_Science\Inceptez\SOURCE\sales_team.csv")
st.head(2)

,Sales Rep,Sales Rep Id,Company Name,Company Id
0,Jessie Mcallister,97UNNAT790E0WM4N,Chimera-Chasing Casbah,LJKS5NK6788CYMUU
1,Jessie Mcallister,97UNNAT790E0WM4N,Tangential Sheds,36MFTZOYMTAJP1RK

In [17]:
pd.merge(ol,st,on='Company Id').head(4)

,Order Id,Company Id,Company Name_x,Date,Order Value,Converted,Sales Rep,Sales Rep Id,Company Name_y
0,80EYLOKP9E762WKG,LJKS5NK6788CYMUU,Chimera-Chasing Casbah,2017-02-18,4875.0,1.0,Jessie Mcallister,97UNNAT790E0WM4N,Chimera-Chasing Casbah
1,TLEXR1HZWTUTBHPB,LJKS5NK6788CYMUU,Chimera-Chasing Casbah,2015-07-30,8425.0,0.0,Jessie Mcallister,97UNNAT790E0WM4N,Chimera-Chasing Casbah
2,839FKFW2LLX4LMBB,LJKS5NK6788CYMUU,Chimera-Chasing Casbah,2016-05-27,4837.0,0.0,Jessie Mcallister,97UNNAT790E0WM4N,Chimera-Chasing Casbah
3,97OX39BGVMHODLJM,LJKS5NK6788CYMUU,Chimera-Chasing Casbah,2018-09-27,343.0,0.0,Jessie Mcallister,97UNNAT790E0WM4N,Chimera-Chasing Casbah

In [20]:
pd.merge(ol[['Order Id','Date','Company Id']],
         st.rename(columns={'Sales Rep':'Devied_col'}),left_on='Company Id',right_on='Company Id')

,Order Id,Date,Company Id,Devied_col,Sales Rep Id,Company Name
0,80EYLOKP9E762WKG,2017-02-18,LJKS5NK6788CYMUU,Jessie Mcallister,97UNNAT790E0WM4N,Chimera-Chasing Casbah
1,TLEXR1HZWTUTBHPB,2015-07-30,LJKS5NK6788CYMUU,Jessie Mcallister,97UNNAT790E0WM4N,Chimera-Chasing Casbah
2,839FKFW2LLX4LMBB,2016-05-27,LJKS5NK6788CYMUU,Jessie Mcallister,97UNNAT790E0WM4N,Chimera-Chasing Casbah
3,97OX39BGVMHODLJM,2018-09-27,LJKS5NK6788CYMUU,Jessie Mcallister,97UNNAT790E0WM4N,Chimera-Chasing Casbah
4,5T4LGH4XGBWOD49Z,2016-01-14,LJKS5NK6788CYMUU,Jessie Mcallister,97UNNAT790E0WM4N,Chimera-Chasing Casbah
...,...,...,...,...,...,...
26849,USVU3XBOTB3UUSGX,2018-02-24,LF85GK2DBRYS10ZA,Colleen Smialek,7ZANOLGQK6GS8M6K,Watery Barge
26850,RHWPAUYMZAUR4790,2015-05-04,LF85GK2DBRYS10ZA,Colleen Smialek,7ZANOLGQK6GS8M6K,Watery Barge
26851,DRAQ8KY395S62DUI,2015-10-02,LF85GK2DBRYS10ZA,Colleen Smialek,7ZANOLGQK6GS8M6K,Watery Barge
26852,7ZU10X0S71A9ISB2,2014-11-17,LF85GK2DBRYS10ZA,Colleen Smialek,7ZANOLGQK6GS8M6K,Watery Barge
26853,FQFTQEKQ4D7JYS8K,2017-05-08,LF85GK2DBRYS10ZA,Colleen Smialek,7ZANOLGQK6GS8M6K,Watery Barge

In [21]:
df.head(2)

,Order Id,Date,Meal Id,Company Id,Date of Meal,Participants,Meal Price,Type of Meal,Heroes Adjustment
0,839FKFW2LLX4LMBB,2016-05-27,INBUX904GIHI8YBD,LJKS5NK6788CYMUU,2016-05-31 07:00:00+02:00,['David Bishop'],469.0,Breakfast,False
1,97OX39BGVMHODLJM,2018-09-27,J0MMOOPP709DIDIE,LJKS5NK6788CYMUU,2018-10-01 20:00:00+02:00,['David Bishop'],22.0,Dinner,False

In [23]:
df.groupby(['Type of Meal','Meal Id']).agg({"Meal Price":np.mean})

                               Meal Price
Type of Meal Meal Id
Breakfast    001DCDCE6S200FA9        52.0
             003BA2DZAP6W2G2E        75.0
             006R11Z6EG7B3P4E       163.0
             00CWGA8NET6JVK8F        18.0
             00IQ0SHRBHGD1PXN       259.0
...                                   ...
Lunch        ZY0AG8KJOBAY42ML       497.0
             ZZ2L53SB7V7F8IPT       456.0
             ZZ92DIHFEH6RVZ2D        23.0
             ZZUW0R5XEOZYJXWT       359.0
             ZZXR6JIJOQFJAMZI       326.0

[14361 rows x 1 columns]

### Pivot table

In [28]:
pd.pivot_table(df,index=['Type of Meal','Meal Id'],values='Meal Price',aggfunc=np.mean)

                               Meal Price
Type of Meal Meal Id
Breakfast    001DCDCE6S200FA9        52.0
             003BA2DZAP6W2G2E        75.0
             006R11Z6EG7B3P4E       163.0
             00CWGA8NET6JVK8F        18.0
             00IQ0SHRBHGD1PXN       259.0
...                                   ...
Lunch        ZY0AG8KJOBAY42ML       497.0
             ZZ2L53SB7V7F8IPT       456.0
             ZZ92DIHFEH6RVZ2D        23.0
             ZZUW0R5XEOZYJXWT       359.0
             ZZXR6JIJOQFJAMZI       326.0

[14361 rows x 1 columns]

In [29]:
### Assignment : Type of Meal,Meal Id,Heroes Adjustment
pd.pivot_table(df,index=['Type of Meal','Meal Id','Heroes Adjustment'],values='Meal Price',aggfunc=np.mean)

                                                 Meal Price
Type of Meal Meal Id          Heroes Adjustment
Breakfast    001DCDCE6S200FA9 False                    52.0
             003BA2DZAP6W2G2E False                    75.0
             006R11Z6EG7B3P4E False                   163.0
             00CWGA8NET6JVK8F False                    18.0
             00IQ0SHRBHGD1PXN False                   259.0
...                                                     ...
Lunch        ZY0AG8KJOBAY42ML False                   497.0
             ZZ2L53SB7V7F8IPT False                   456.0
             ZZ92DIHFEH6RVZ2D False                    23.0
             ZZUW0R5XEOZYJXWT False                   359.0
             ZZXR6JIJOQFJAMZI False                   326.0

[14361 rows x 1 columns]

In [31]:
temp = df.groupby(['Type of Meal','Meal Id','Heroes Adjustment']).agg({"Meal Price":np.mean})

In [32]:
temp.head(2)

                                                 Meal Price
Type of Meal Meal Id          Heroes Adjustment
Breakfast    001DCDCE6S200FA9 False                    52.0
             003BA2DZAP6W2G2E False                    75.0

In [34]:
temp.unstack(level = 'Type of Meal').head(2)

                                   Meal Price
Type of Meal                        Breakfast Dinner Lunch
Meal Id          Heroes Adjustment
001DCDCE6S200FA9 False                   52.0    NaN   NaN
003BA2DZAP6W2G2E False                   75.0    NaN   NaN